from random import choice
import dora

host = "http://localhost:3090/"
robo = dora.Robot()
word = [
	["このあとすぐ", "今日の夜", "明日", "あさって", "いつか", "1年後", "1週間後", "61年後", "40年後", "53年後", "53年後", "47年後", "6年後", "90年後", "83年後", "12年後", "97年後", "21年後", "21年後", "91年後", "21年後", "15年後", "42年後", "55年後", "18年後", "3年後", "78年後", "4年後", "77年後", "49年後", "20年後", "90年後", "46年後", "6年後", "82年後", "62年後", "23年後", "ケチャップの日に", "午後9時31分頃", "午前6時22分頃", "午後5時41分頃", "午前4時49分頃", "20時間後", "3時間後", "20時間後", "8時間後", "17時間後", "10時間後", "19時間後", "11時間後", "19時間後", "13時間後", "2週間後", "3週間後"],
	["家で", "公園で", "ゲーセンで", "ショッピングモールで", "トイレで", "キッチンで", "道路のど真ん中で", "電車の中で", "廊下で", "学校で", "車の中で", "国会議事堂で", "どこかで", "お風呂で", "玄関で", "ホテルで", "宇宙で", "海で", "山で", "駅で", "地獄で", "天国で", "モグラの巣で", "最近人気のソフトクリーム屋で", "ケチャップの中で", "病院で", "ユニバで", "焼肉屋さんで", "スーパーで", "映画館で", "海で", "ビーチで", "地獄で", "おもちゃ屋さんの前で", "ロシアで", "ブラジルで", "宇宙で", "テーブルの上で", "校長室で", "扇風機の前で", "お悩み相談室で", "幼稚園で", "北朝鮮で", "メダカの水槽の中で", "ドラえもんの家で", "銀座で", "アンパンマンのパン工場で", "洞窟で", "森で", "コンビニで", "タイムマシンの中で", "上空で", "東大で", "マンションの屋上で", "テレビの前で"],
	["華麗に", "カッコよく", "スマホをいじりながら", "スキップしながら", "発狂しながら", "鼻くそをほじりながら", "テレビを見ながら", "寝ながら", "光速で回転しながら", "ポテチを食いながら", "なぜか知らないけど", "新しい", "欲しかった", "真っ白な", "誰かにケチャップまみれにされた", "でっかい", "去年買った", "そこらへんにあった", "ゴミ箱に入ってた", "凍ってる", "ピカピカの", "ノリツッコミしながら", "くさいセリフを言いながら", "謎のセリフをつぶやきながら", "だまされるがままに", "ふざけて", "ボスの命令で", "5000円で買った", "間違えて", "ゲームしたかったけど", "大人数で", "光る", "仕事さぼって", "よくわからないまま", "おやじギャグを華麗にスルーして"],
	["スマホを", "友達を", "パソコンを", "服を", "エアコンを", "寿司を", "Scratchを", "海を", "山を", "地球を", "破壊光線を", "車を", "ゲーム機を", "なにかを", "ハンバーグを", "3DSを", "レゴブロックを", "扇風機を", "momosaburouを", "岩を", "鏡を", "ポテチを", "momosaburouを", "ネコを", "犬を", "ゴリラを", "チンパンジーを", "パパを", "トイレを", "古新聞を", "だれかを", "餃子を", "たらこパスタを", "たらこ唇のおっさんを", "トイレットペーパーを", "鼻をかんだ紙を", "草を"],
	["だれかに投げつける", "頭突きで粉砕する", "パンチで破壊する", "食べる", "神様に捧げる", "車でひく", "インスタ映えする", "振り回す", "ケチャップまみれにする", "手品でウサギに変える", "飲み込む", "買う", "メルカリで100円で売る", "捨てる", "踏んづける", "へし折る", "アリの巣にぶち込む", "からかう", "Lv.MAXにパワーアップさせる", "ペットにする", "ガン見する", "切り刻む", "縛り上げる", "SNSで拡散する", "ポイ捨てする", "倒してアイテムをゲットする", "七夕の短冊にする", "チャーハンにする", "食べようとしたけど、やっぱりおうどんを食べる", "捕まえて「おうどん食べたい!!!」と叫ぶ", "食おうとするが、逆に食われる", "ご飯と混ぜて、炊き込みご飯を作る", "生やす", "片手で持ち上げる", "課長に昇進させる"]
]

random_word = [choice(word[n]) for n in range(len(word))]

robo.textToSpeech("".join(random_word))